const Mysql = require('mysql')

const MysqlList = {
    PageList: () => {
        let poolCluster = Mysql.createConnection()
    }
}

module.exports = MysqlList


/* 
天道
丁元英回答道：“ 大师考问晚辈自在情理之中， 晚辈就斗胆妄言了。 所谓真经， 就是能够达到寂空涅碦的究竟法门， 可悟不可修。 修为成佛， 在求。 悟为明性， 在知。 修行以行制性， 悟道以性施行， 觉者由心生律， 修者以律制心。 不落恶果者有信无证， 住因住果、 住念住心， 如是生灭。 不昧因果者无住而住， 无欲无不欲， 无戒无不戒， 如是涅碦。”
智玄大师含笑而问：“ 不为成佛， 那什么是佛教呢？”
丁元英说：“ 佛乃觉性， 非人， 人人都有觉性不等于觉性就是人。 人相可坏， 觉性无生无灭， 即觉即显， 即障即尘蔽， 无障不显， 了障涅碦。 觉行圆满之佛乃佛教人相之佛， 圆满即止， 即非无量。 若佛有量， 即非阿弥陀佛。 佛法无量即觉行无量， 无圆无不圆， 无满无不满， 亦无是名究竟圆满。 晚辈个人以为， 佛教以次第而分， 从精深处说是得道天成的道法， 道法如来不可思议， 即非文化。 从浅义处说是导人向善的教义， 善恶本有人相、 我相、 众生相， 即是文化。 从众生处说是以贪制贪、 以幻制幻的善巧， 虽不灭败坏下流， 却无碍抚慰灵魂的慈悲。”
智玄大师说：“ 以施主之文笔言辞断不是佛门中人， 施主参意不拘经文， 自悟能达到这种境界已属难能可贵。 以贫僧看来， 施主已经踩到得道的门槛了， 离得道只差一步， 进则净土， 退则凡尘， 只是这一步难如登天。”
丁元英说：“ 承蒙大师开示， 惭愧！ 惭愧！ 佛门讲一个‘ 缘’ 字， 我与佛的缘站到门槛就算缘尽了， 不进不出， 亦邪亦正。 与基督而言我进不得窄门， 与佛而言我不可得道。 我是几等的货色大师已从那首词里看得明白， 装了斯文， 露了痞性， 满纸一个‘ 嗔’ 字。 今天来到佛门净地拜见大师， 只为讨得一个心安。”
丁元英说：“ 晚辈以为， 传统观念的死结就在一个‘ 靠’ 字上， 在家靠父母， 出门靠朋友， 靠上帝、 靠菩萨、 靠皇恩…… 总之靠什么都行， 就是别靠自己。 这是一个沉积了几千年的文化属性问题， 非几次新文化运动就能开悟。 晚辈无意评说道法， 只在已经缘起的事情里顺水推舟， 借英雄好汉的嗓子喊上两声， 至少不违天道朝纲。”
韩楚风来五台山之前只知道丁元英要拜见高僧大德， 少不了谈经论道， 却并不知道丁元英拜佛的具体目的， 直到这时才完全明白。
智玄大师说：“ 以施主之参悟， 心做心是， 何来讨个心安呢？”
丁元英说：“ 无忏无愧的是佛， 晚辈一介凡夫， 不过是多识几个字的嘴上功夫， 并无证量可言。 我知道人会骂我， 我以为佛不会骂我， 是晚辈以为， 并非真不会挨骂。 大师缘何为大师？ 我以为是代佛说话的觉者。”
智玄大师略微思忖了一下， 说：“ 贫僧乃学佛之人， 断不可代佛说话， 亦非大师。 得救之道自古仁人志士各有其说， 百家争鸣。 贫僧受不起施主一个‘ 讨’ 字， 仅以修证之理如实观照， 故送施主四个字： 大爱不爱。”
丁元英双手合十给智玄大师恭敬行了一个佛礼， 说道：“ 谢大师！”
智玄大师说：“ 弱势得救之道， 也有也没有。 没有竞争的社会就没有活力， 而竞争必然会产生贫富、 等级， 此乃天道， 乃社会进步的必然代价。 无弱， 强焉在？ 一个‘ 强’ 字， 弱已经在其中了。 故而， 佛度心苦， 修的是一颗平常心。”
韩楚风因为先前不了解情况， 所以一直没有参与谈话。 此时听了智玄大师一番话心生感慨， 说道：“ 佛教主张利和同均， 大师坦言等级乃天道与代价， 不拘门户之见， 令晚辈十分敬佩。 晚辈在想， 如果强者在公开、 合法的情况下都可以做到杀掠， 那么在不公开、 不合法的条件下， 弱势还剩下多大空间？ 佛度心苦虽慈悲， 但人毕竟还有物质的一面。”
智玄大师对韩楚风笑了笑， 说：“ 施主不必拘礼， 请讲。”
韩楚风说：“ 如果主流文化能在弱势群体期望破格获取与强势群体期望更高生命价值的社会需求之间建立一个链接的纽带， 或许更有积极意义。 强势群体仅仅适用一般的竞争规则是不够的， 主流文化应该对强势道德提出更高的要求， 构建强势文化体系， 赋予强势群体更高的生命价值。 当然， 这首先是以不平等为先决条件。”
智玄大师说：“ 利和同均， 不平等已在其中。”
韩楚风说：“ 主流文化， 当是推动社会进步、 改善社会关系的文化。 如果人的行为首先是政治的或宗教的需要， 那么这种价值无疑也首先是政治的或宗教的价值。 当社会将道德价值全部锁定在政治文化和宗教文化的时候， 个人道德就没有价值空间了， 既不利于鼓励强势对弱势的关注， 也不利于社会整体道德素质由量变到质变的转化。”
智玄大师说：“ 施主的观点与佛教的主张并不矛盾， 不同的是施主认为主流文化应该给强者个人一定的道德价值空间。 贫僧以为， 无论功德记在哪一家的账上， 风调雨顺、 国泰民安都将是众生的福报。”
韩楚风说：“ 只是， 等级一直是我们社会文化的禁区， 大家所以小心翼翼绕开禁区， 是唯恐平等、 尊严之类的东西受到伤害。”
喝过一道茶， 智玄大师给大家续上一轮开水， 对丁元英宽怀一笑， 说：“ 释、 道、 儒是中国传统文化的三大体系， 施主这一刀下去， 一个都没幸免哪， 哈哈哈……”
丁元英说：“ 不敢， 不敢。 释、 道、 儒均是博大精深的学派， 支撑中华民族走过了几千年的文明历程， 是伟大的文明。 但是， 社会在发展， 传统文化毕竟是以皇恩浩荡为先决条件的文化， 讲的都是皆空、 无为、 中庸的理， 以抑制个性而求生求解。 当今社会已经发展到了市场经济的民主与法制， 诸家学说也面临一个如实观照而俱进的课题， 是传统？ 还是传承？ 统则僵死， 承则光大。”
智玄大师说：“ 施主尚未畅所欲言， 不好。 海纳百川， 施主纵是沧海一滴， 我佛也愿汇而融之。 今日有缘一叙， 自当请施主开诚布公， 以利佛理修证。”
丁元英说：“ 晚辈叹服佛法究竟真理真相的辩证思维， 如是不可思议。 但是， 晚辈以为佛教包括了佛法， 而佛法有别于佛教。 佛教以佛法证一， 进而证究竟， 最终是为给心找个不苦的理由， 成佛， 无量寿， 极乐。 佛教以假度真的方便法门住福相、 住寿相、 住果相， 是以无执无我为名相的太极我执， 致使佛教具有了迷信、 宿命、 贪执的弱势文化特征， 已然障蔽佛法晚辈以为， 如果佛教能依佛法破除自身迷障， 不住不拘个人解脱， 以佛法的如是不可思议究竟生产力与文明的真理真相， 则佛法的佛教即出离宗教的佛教， 成为觉悟众生的大乘法度， 慧于纲纪泽于民生， 是名普度众生.

*/
